WHU-EIS-Robotics/MSPM0-DevKit/UART/Driver/ti/driverlib/dl_dac12.h
    return (DL_DAC12_SAMPLES_PER_SECOND)(sampleRate);
}

/**
 *  @brief      Sets the sample triggering rate of the sample time generator
 *
 *  Sets the sample trigger rate of the sample time generator.
 *  The sample time generator can be selected as the FIFO Trigger @ref
 *  DL_DAC12_setFIFOTriggerSource and control the rate at which the DAC will
 *  consume inputs from the FIFO
 *
 *  @param[in]  dac12       pointer to the register overlay of the peripheral
 *  @param[in]  sampleRate  Desired sample rate. One of
 *                          @ref DL_DAC12_SAMPLES_PER_SECOND
 */
__STATIC_INLINE void DL_DAC12_setSampleRate(
    DAC12_Regs *dac12, DL_DAC12_SAMPLES_PER_SECOND sampleRate)
{
    DL_Common_updateReg(
        &dac12->CTL3, (uint32_t) sampleRate, DAC12_CTL3_STIMCONFIG_MASK);
}

/**
 *  @brief      Checks whether a calibration sequence is currently running
 *
 *  @param[in]  dac12    pointer to the register overlay of the peripheral
 *
 *  @return     Current status of an active calibration sequence
 *
 *  @retval     true  Calibration Sequence is currently running
 *  @retval     false Calibration Sequence is not running
 *
 *  @sa         DL_DAC12_startCalibration
 */
__STATIC_INLINE bool DL_DAC12_isCalibrationRunning(DAC12_Regs *dac12)
{
    uint32_t t = (dac12->CALCTL & DAC12_CALCTL_CALON_MASK);
    return (t == DAC12_CALCTL_CALON_ACTIVE);
}

/**
 *  @brief      Initiates the DAC offset error calibration sequence
 *
 *  Initiates the DAC offset error calibration sequence and
 *  the CALON_ACTIVE bit is automatically reset when the offset error
 *  calibration completes. Upon completion, the correct calibration will be put
 *  into the CALDATA register. This sequence can be started either on the fly
 *  (once the module is ready) or during setup (where this is called directy
 *  after enabling the DAC).
 *
 *  In order for the calibration to be successful, the AMP must already be
 *  configured and the LOCK bit must be cleared for the value to be written
 *  successfully. The output is also tri-stated during calibration.
 *
 *  A negative offset will mean that low input values will have a output of 0.
 *  A positive offset will mean that an input of 0 will result in a non-zero
 *  output.
 *
 *  @param[in]  dac12   pointer to the register overlay of the peripheral
 */
__STATIC_INLINE void DL_DAC12_startCalibration(DAC12_Regs *dac12)
{
    dac12->CALCTL =
        (DAC12_CALCTL_CALON_ACTIVE | DAC12_CALCTL_CALSEL_SELFCALIBRATIONTRIM);
}

/**
 *  @brief      Gets the DAC Calibration offset
 *
 *  Reads of the CALDATA register should only be performed after the
 *  calibration sequence has completed. During calibration, this register is
 *  continuously written to, and inaccurate values could be obtained.
 *
 *  @param[in]  dac12 pointer to the register overlay of the peripheral
 *
 *  @return     Current error calibration offset
 *
 *  @retval     -64 to +63 in two's complement
 */
__STATIC_INLINE uint32_t DL_DAC12_getCalibrationData(DAC12_Regs *dac12)
{
    return (dac12->CALDATA & DAC12_CALDATA_DATA_MASK);
}

/**
 *  @brief      Perform calibration sequence
 *
 *  Enables writes, and then starts the calibration sequence. Should only be
 *  called after the DAC module is enabled. This will only return when the
 *  calibration sequence has completed.
 *
 *  @pre Amplifier settings should be configured. @ref DL_DAC12_setAmplifier
 *  @post Calibration is complete, and CALDATA is locked to prevent writes.
 *
 *  @param[in]  dac12   pointer to the register overlay of the peripheral
 */
void DL_DAC12_performSelfCalibrationBlocking(DAC12_Regs *dac12);

/**
 *  @brief      Outputs an 8-bit data value
 *
 *  Using the CPU to control the DAC, this register can be written to if a
 *  fixed output voltage is desired (ex. DC Generation) with the FIFO disabled,
 *  or it can write with variable output (ex. AC Generation) by enabling the
 *  FIFO and writing to this register. The value will then be written to the
 *  FIFO internally. With FIFO enabled with @ref DL_DAC12_enableFIFO, the
 *  FIFO-specific interrupts will be generated inside the DAC.
 *
 *  The DMA trigger generation mechanism must be kept disabled when CPU is used
 *  to load data into DAC
 *
 *  @param[in]  dac12       pointer to the register overlay of the peripheral
 *  @param[in]  dataValue   value to be written to the bit-field from 0x0 to
 *                          0xFF. It can be either binary or two's complement
 */
__STATIC_INLINE void DL_DAC12_output8(DAC12_Regs *dac12, uint8_t dataValue)
{
    dac12->DATA0 = dataValue;
}

/**
 *  @brief      Outputs a 12-bit Data Value
 *
 *  Using the CPU to control the DAC, this register can be written to if a
 *  fixed output voltage is desired (ex. DC Generation) with the FIFO disabled,
 *  or it can write with variable output (ex. AC Generation) by enabling the
 *  FIFO and writing to this register. The value will then be written to the
 *  FIFO internally. With FIFO enabled with @ref DL_DAC12_enableFIFO, the
 *  FIFO-specific interrupts will be generated inside the DAC.
 *
 *  The DMA trigger generation mechanism must be kept disabled when CPU is used
 *  to load data into DAC
 *
 *  @param[in]  dac12       pointer to the register overlay of the peripheral
 *  @param[in]  dataValue   value to be written to the bit-field from 0x0 to
 *                          0xFFF. It can be either binary or two's complement
 */
__STATIC_INLINE void DL_DAC12_output12(DAC12_Regs *dac12, uint32_t dataValue)
{
    dac12->DATA0 = (dataValue & DAC12_DATA0_DATA_VALUE_MASK);
}

/**
 *  @brief      Fills the DAC fifo with 8-bit data values from the buffer
 *
 *  Writes as many values from the data buffer to the FIFO as possible,
 *  and then exits when either the count is matched or the FIFO is full.
 *
 *  @param[in]  dac12       pointer to the register overlay of the peripheral
 *  @param[in]  buffer      array containing the data values (0x00 - 0xFF) to
 *                          be written
 *  @param[in]  count       length of the buffer, or maximum desired transfer
 *
 *  @return     Count successfully transferred to the FIFO
 *
 *  @retval     0 - max(number of empty fifo slots, count)
 */
uint32_t DL_DAC12_fillFIFO8(
    DAC12_Regs *dac12, uint8_t *buffer, uint32_t count);

/**
 *  @brief      Fills the DAC fifo with 12-bit data values from the buffer
 *
 *  Writes as many values from the data buffer to the FIFO as possible,
 *  and then exits when either the count is matched or the FIFO is full.
 *
 *  @param[in]  dac12       pointer to the register overlay of the peripheral
 *  @param[in]  buffer      array containing the data values (0x00 - 0xFFF) to
 *                          be written
 *  @param[in]  count       length of the buffer, or maximum desired transfer
 *
 *  @return     Count successfully transfered to the FIFO
 *
 *  @retval     0 - max(number of empty fifo slots, count)
 */
uint32_t DL_DAC12_fillFIFO12(
    DAC12_Regs *dac12, uint16_t *buffer, uint32_t count);

/**
 *  @brief      Blocking 8-bit output to the DAC FIFO
 *
 *  Waits until the FIFO is not full, then writes a single value
 *
 *  @param[in]  dac12        pointer to the register overlay of the peripheral
 *  @param[in]  data         data value (0x00 - 0xFF) to be written
 */
void DL_DAC12_outputBlocking8(DAC12_Regs *dac12, uint8_t data);

/**
 *  @brief      Blocking 12-bit output to the DAC FIFO
 *
 *  Waits until the FIFO is not full, then writes a single value
 *
 *  @param[in]  dac12        pointer to the register overlay of the peripheral
 *  @param[in]  data         data value (0x000 - 0xFFF) to be written
 */
void DL_DAC12_outputBlocking12(DAC12_Regs *dac12, uint16_t data);

/**
 *  @brief      Checks the raw interrupt status of one or more interrupts
 *
 *  The raw interrupt status is independent of whether a specific interrupt is
 *  enabled.
 *
 *  @param[in]  dac12         pointer to the register overlay of the peripheral
 *  @param[in]  interruptMask the desired interrupt(s). One or more of
 *                            @ref DL_DAC12_INTERRUPT
 *
 *  @return     currently asserted interrupts (whether enabled or not) bit-wise
 *              AND with the inputted interrupts
 *
 *  @retval     0       no interrupts that were inputted are currently asserted
 *  @retval     not 0   a bit-wise OR of the inputted @ref DL_DAC12_INTERRUPT
 *                      registers that are currently asserted.
 */
__STATIC_INLINE uint32_t DL_DAC12_getInterruptStatus(
    DAC12_Regs *dac12, uint32_t interruptMask)
{
    return (dac12->INT_EVENT[0].RIS & interruptMask);
}

/**
 *  @brief      Clears the interrupt status of one or more interrupts
 *
 *  Accesses the write only interrupt clear (ICLR) register and writes a 1 to
 *  the bits specified. Any bit that has 1 written to it will clear that pending
 *  interrupt if it is currently pending.
 *
 *  @param[in]  dac12         pointer to the register overlay of the peripheral
 *  @param[in]  interruptMask the desired interrupt(s). One or more of
 *                            @ref DL_DAC12_INTERRUPT
 */
__STATIC_INLINE void DL_DAC12_clearInterruptStatus(
    DAC12_Regs *dac12, uint32_t interruptMask)
{
    dac12->INT_EVENT[0].ICLR = interruptMask;
}

/**
 *  @brief      Enables one or more interrupts
 *
 *  Access and write to the IMASK register to enable the interrupts specified.
 *
 *  @param[in]  dac12         pointer to the register overlay of the peripheral
 *  @param[in]  interruptMask the desired interrupt(s). One or more of
 *                            @ref DL_DAC12_INTERRUPT
 */
__STATIC_INLINE void DL_DAC12_enableInterrupt(
    DAC12_Regs *dac12, uint32_t interruptMask)
{
    dac12->INT_EVENT[0].IMASK |= interruptMask;
}

/**
 *  @brief      Disables one or more interrupts
 *
 *  Access and write to the IMASK register to disable the interrupts specified.
 *
 *  @param[in]  dac12         pointer to the register overlay of the peripheral
 *  @param[in]  interruptMask the desired interrupt(s). One or more of
 *                            @ref DL_DAC12_INTERRUPT
 */
__STATIC_INLINE void DL_DAC12_disableInterrupt(
    DAC12_Regs *dac12, uint32_t interruptMask)
{
    dac12->INT_EVENT[0].IMASK &= ~interruptMask;
}

/**
 *  @brief      Gets the highest priority pending interrupt
 *
 *  Accesses and reads the IIDX register to obtain the highest currently
 *  pending interrupt. Interrupts with lower offsets (and smaller values) are
 *  higher priority than interrupts with higher offsets (and larger values).
 *  In order for the interrupt to be pending, it must have been enabled and
 *  asserted. Clearing the interrupt should will un-pend the interrupt.
 *
 *  @param[in]  dac12        pointer to the register overlay of the peripheral
 *
 *  @return     highest priority pending interrupt
 *
 *  @retval     One of @ref DL_DAC12_IIDX
 */
__STATIC_INLINE DL_DAC12_IIDX DL_DAC12_getPendingInterrupt(DAC12_Regs *dac12)
{
    return ((DL_DAC12_IIDX) dac12->INT_EVENT[0].IIDX);
}

/**
 *  @brief      Checks if the DAC FIFO is currently full
 *
 *  Accesses the raw interrupt status (RIS) register in order to get the
 *  current state of the FIFOFull Interrupt flag.
 *
 *  @param[in]  dac12        pointer to the register overlay of the peripheral
 *
 *  @return     status of FIFO full interrupt flag
 *
 *  @retval     true   FIFO is currently full
 *  @retval     false  FIFO is not full
 */
__STATIC_INLINE bool DL_DAC12_isFIFOFull(DAC12_Regs *dac12)
{
    uint32_t t =
        DL_DAC12_getInterruptStatus(dac12, DL_DAC12_INTERRUPT_FIFO_FULL);
    return (t == DL_DAC12_INTERRUPT_FIFO_FULL);
}

/**
 *  @brief Sets the event publisher channel id
 *
 *  @param[in]  dac12 Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_DAC12_setPublisherChanID(
    DAC12_Regs *dac12, uint8_t chanID)
{
    dac12->FPUB_1 = (chanID & DAC12_FPUB_1_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel id
 *
 *  @param[in]  dac12 Pointer to the register overlay for the
 *                      peripheral
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_DAC12_getPublisherChanID(DAC12_Regs *dac12)
{
    return ((uint8_t)((dac12->FPUB_1) & DAC12_FPUB_1_CHANID_MASK));
}

/**
 *  @brief Sets the event subscriber channel id
 *
 *  @param[in]  dac12 Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index   Specifies the register event index to be configured
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      subscriber is disconnected.
 */
__STATIC_INLINE void DL_DAC12_setSubscriberChanID(
    DAC12_Regs *dac12, DL_DAC12_SUBSCRIBER_INDEX index, uint8_t chanID)
{
    volatile uint32_t *pReg = &dac12->FSUB_0;

