WHU-EIS-Robotics/MSPM0-DevKit/UART/Driver/ti/driverlib/dl_dac12.h
    *(pReg + (uint32_t) index) = (chanID & DAC12_FSUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event subscriber channel id
 *
 *  @param[in]  dac12 Pointer to the register overlay for the peripheral
 *  @param[in]  index  Specifies the register event index to be configured
 *
 *  @return     Event subscriber channel ID
 *
 */
__STATIC_INLINE uint8_t DL_DAC12_getSubscriberChanID(
    DAC12_Regs *dac12, DL_DAC12_SUBSCRIBER_INDEX index)
{
    volatile uint32_t *pReg = &dac12->FSUB_0;

    return ((uint8_t)(*(pReg + (uint32_t) index) & DAC12_FSUB_0_CHANID_MASK));
}

/**
 *  @brief      Enable DAC event
 *
 *  @param[in]  dac12        Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_DAC12_EVENT.
 */
__STATIC_INLINE void DL_DAC12_enableEvent(
    DAC12_Regs *dac12, uint32_t eventMask)
{
    dac12->INT_EVENT[1].IMASK |= (eventMask);
}

/**
 *  @brief      Disable DAC event
 *
 *  @param[in]  dac12        Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_DAC12_EVENT.
 */
__STATIC_INLINE void DL_DAC12_disableEvent(
    DAC12_Regs *dac12, uint32_t eventMask)
{
    dac12->INT_EVENT[1].IMASK &= ~(eventMask);
}

/**
 *  @brief      Check which DAC events are enabled
 *
 *  @param[in]  dac12        Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_DAC12_EVENT.
 *
 *  @return     Which of the requested DAC interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_DAC12_EVENT values
 */
__STATIC_INLINE uint32_t DL_DAC12_getEnabledEvents(
    DAC12_Regs *dac12, uint32_t eventMask)
{
    return ((dac12->INT_EVENT[1].IMASK) & (eventMask));
}

/**
 *  @brief      Check event flag of enabled DAC event
 *
 *  Checks if any of the DAC events that were previously enabled are
 *  pending.
 *
 *  @param[in]  dac12        Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_DAC12_EVENT.
 *
 *  @return     Which of the requested DAC interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_DAC12_EVENT values
 *
 *  @sa         DL_DAC12_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_DAC12_getEnabledEventStatus(
    DAC12_Regs *dac12, uint32_t eventMask)
{
    return ((dac12->INT_EVENT[1].MIS) & eventMask);
}

/**
 *  @brief      Check interrupt flag of any DAC event
 *
 *  Checks if any events are pending. Events do not have to
 *  be previously enabled.
 *
 *  @param[in]  dac12        Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask      Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_DAC12_EVENT.
 *
 *  @return     Which of the requested DAC interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_DAC12_EVENT values
 */
__STATIC_INLINE uint32_t DL_DAC12_getRawEventsStatus(
    DAC12_Regs *dac12, uint32_t eventMask)
{
    return ((dac12->INT_EVENT[1].RIS) & eventMask);
}

/**
 *  @brief      Clear pending DAC events
 *
 *  @param[in]  dac12        Pointer to the register overlay for the peripheral
 *  @param[in]  eventMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_DAC12_EVENT.
 */
__STATIC_INLINE void DL_DAC12_clearEventsStatus(
    DAC12_Regs *dac12, uint32_t eventMask)
{
    dac12->INT_EVENT[1].ICLR |= (eventMask);
}

#ifdef __cplusplus
}
#endif
#endif /* __MSPM0_HAS_DAC12__ */

#endif /* ti_dl_dl_dac12__include */
/** @}*/
